{
  "humira": {
    "name": "Humira",
    "description": "Humira (adalimumab) is a monoclonal antibody that selectively binds tumor necrosis factor-alpha (TNF‑α), blocking its inflammatory activity. It is used to treat several autoimmune conditions, including rheumatoid arthritis, psoriatic arthritis, ankylosing spondylitis, Crohn’s disease, ulcerative colitis, plaque psoriasis, and hidradenitis suppurativa. By dampening TNF‑α signaling, Humira reduces joint pain, swelling, and systemic inflammation associated with these diseases.",
    "advice": "Humira is typically administered as a subcutaneous injection once every two weeks (or weekly for certain indications). Patients should rotate injection sites, use the supplied prefilled syringe or autoinjector, and keep the medication refrigerated until it reaches room temperature before injecting. Record each dose in a diary to ensure adherence and report any missed injections promptly.",
    "warning": "Common side effects include injection site reactions, upper respiratory infections, headache, and nausea; more serious risks involve increased susceptibility to infections (including tuberculosis), infusion reactions, heart failure exacerbation, and rare malignancies such as lymphoma or skin cancers. Patients should be screened for latent TB and monitored for signs of infection or new symptoms while on therapy.",
    "pubmed_link": "https://pubmed.ncbi.nlm.nih.gov/?term=humira"
  },
  "eliquis": {
    "name": "Eliquis",
    "description": "Eliquis (apixaban) is an oral anticoagulant that inhibits factor Xa, preventing blood clot formation. It is commonly prescribed to reduce the risk of stroke and systemic embolism in patients with non‑valvular atrial fibrillation. Eliquis also treats acute deep vein thrombosis (DVT) and pulmonary embolism (PE), as well as for long‑term prevention of recurrent DVT/PE.",
    "advice": "Take Eliquis exactly as directed by your healthcare provider, usually twice daily at evenly spaced intervals, with or without food. Swallow tablets whole; do not crush or chew them. Keep a consistent schedule and inform your doctor if you miss a dose to avoid clotting complications.",
    "warning": "Major bleeding is the most serious risk; watch for unusual bruising, blood in urine or stool, or persistent nosebleeds. Do not use Eliquis with other anticoagulants, NSAIDs, or certain herbal supplements unless advised by a clinician. Inform your doctor of any kidney problems or liver disease, as dose adjustments may be necessary.",
    "pubmed_link": "https://pubmed.ncbi.nlm.nih.gov/?term=eliquis"
  },
  "opdivo": {
    "name": "Opdivo",
    "description": "Opdivo (nivolumab) is a monoclonal antibody that blocks the PD‑1 pathway, enhancing T‑cell activity against cancer cells. It is approved for treating advanced melanoma, non‑small cell lung cancer, renal cell carcinoma, bladder cancer, head and neck squamous cell carcinoma, microsatellite instability–high colorectal cancer, Hodgkin lymphoma, and certain other solid tumors. The drug works by releasing the brakes on the immune system so it can recognize and destroy tumor cells.",
    "advice": "Opdivo is administered intravenously every 2 or 4 weeks depending on the indication; patients should receive a pre‑infusion assessment for allergies and baseline blood work. During infusion, monitor for infusion reactions and ensure proper hydration. After treatment, report any new symptoms promptly to your oncologist.",
    "warning": "Common side effects include fatigue, rash, diarrhea, nausea, and decreased appetite; immune-related adverse events such as colitis, hepatitis, pneumonitis, endocrinopathies, or nephritis may occur and require early detection. Severe allergic reactions can happen during infusion; patients with a history of severe hypersensitivity should be monitored closely. Always report any unexplained fever, shortness of breath, or worsening symptoms.",
    "pubmed_link": "https://pubmed.ncbi.nlm.nih.gov/?term=opdivo"
  },
  "keytruda": {
    "name": "Keytruda",
    "description": "Keytruda (pembrolizumab) is a monoclonal antibody that blocks the PD‑1 pathway, enabling the immune system to recognize and attack cancer cells. It is approved for use in several solid tumors including melanoma, non‑small cell lung cancer, head and neck squamous cell carcinoma, urothelial carcinoma, Hodgkin lymphoma, gastric cancer, and others when programmed death ligand‑1 (PD‑L1) expression or tumor mutational burden criteria are met. The drug works by reactivating T‑cells that have been suppressed by the tumor’s immune evasion mechanisms.",
    "advice": "Keytruda is administered intravenously every 3 to 6 weeks, depending on the indication, with each infusion lasting about 30 minutes. It should be given under medical supervision in a clinical setting; patients must receive pre‑infusion monitoring and have access to emergency care for potential hypersensitivity reactions.",
    "warning": "Common side effects include fatigue, nausea, decreased appetite, rash, and diarrhea; immune‑related adverse events such as colitis, hepatitis, pneumonitis, endocrinopathies, and skin reactions can occur and may require prompt treatment. Patients should report any new or worsening symptoms immediately, and routine laboratory monitoring is recommended to detect early signs of organ dysfunction.",
    "pubmed_link": "https://pubmed.ncbi.nlm.nih.gov/?term=keytruda"
  },
  "enbrel": {
    "name": "Enbrel",
    "description": "Enbrel is medicine that helps stop the body’s immune system from hurting joints. It treats arthritis like rheumatoid arthritis and psoriatic arthritis.",
    "advice": [
      "• Use only as your doctor says.",
      "• Get it injected by a nurse or learn to give yourself if told.",
      "• Store in the fridge until you use it.",
      "• Wash hands before each injection."
    ],
    "warning": [
      "• Tell your doctor about any infections or fevers first.",
      "• Don’t get shots for other vaccines at the same time.",
      "• If you feel very tired, fever, or a rash, call your doctor.",
      "• Avoid strong alcohol while using Enbrel."
    ],
    "pubmed_link": "https://pubmed.ncbi.nlm.nih.gov/?term=enbrel"
  },
  "herceptin": {
    "name": "Herceptin",
    "description": "Herceptin is a medicine that helps fight certain breast cancers. It works by blocking a protein called HER2 that makes cancer cells grow fast. Doctors give it when the tumor has too many of these proteins.",
    "advice": "• Take your dose at the same time every day\n• Use a full glass of water to swallow the tablet\n• Keep all your follow‑up appointments with the doctor\n• Tell your doctor about any other medicines you use",
    "warning": "• Do not share Herceptin with anyone else\n• If you feel very tired or dizzy, call your doctor right away\n• Report swelling in hands or feet to the medical team\n• Avoid getting a blood test if you have an infection at that time",
    "pubmed_link": "https://pubmed.ncbi.nlm.nih.gov/?term=herceptin"
  }
}